# StructConnectionBeamEnd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructConnectionBeamEnd Property
ParameterTypeId Class See Also
---
"End Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructConnectionBeamEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructConnectionBeamEnd As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructConnectionBeamEnd {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace